In [2]:
#***** Pandas Tutorial***

#for data analysis jupyter notebook is very good

#if we use excel instead of pandas then we cant take advantage of python functions

In [3]:
import numpy as np
import pandas as pd

In [4]:
# create a dictionary.

dict1 = {'name': ['liva','liza','rinku'],
         'age':[28,30,23],
         'goodname': ['prativa', 'suprava', 'ashutosh']
    
}

In [5]:
dict1

{'name': ['liva', 'liza', 'rinku'],
 'age': [28, 30, 23],
 'goodname': ['prativa', 'suprava', 'ashutosh']}

In [6]:
# make a variable df. imported pd here.
#Data frame is a two-dimensional data structure, used for faster indexing for large datasets
#i.e., data is aligned in a tabular fashion in rows and columns. 0,1,2 called index
# Convert the dictionary into DataFrame 


df = pd.DataFrame(dict1)

In [7]:
df

    name  age  goodname
0   liva   28   prativa
1   liza   30   suprava
2  rinku   23  ashutosh

In [8]:
df.columns

Index(['name', 'age', 'goodname'], dtype='object')

In [9]:
# df.index

In [10]:
# export the dataframe to csv file. a csv file is created in your folder.
# error throws when you run this command when csv file is already open
df.to_csv('myfile1.csv')

In [11]:
# to remove the index numbering in your csv file. 
#index is showing here but not in csv file

df.to_csv('myfile1falseindex.csv', index=False)

In [12]:
df

    name  age  goodname
0   liva   28   prativa
1   liza   30   suprava
2  rinku   23  ashutosh

In [13]:
#if you want to see only top 2 rows

df.head(2)

   name  age goodname
0  liva   28  prativa
1  liza   30  suprava

In [14]:
#if you want to see only last 2 rows

df.tail(2)

    name  age  goodname
1   liza   30   suprava
2  rinku   23  ashutosh

In [15]:
#describe()- view some basic statistical details of columns having numeric values in df
# only age col has numeric values.

df.describe()

             age
count   3.000000
mean   27.000000
std     3.605551
min    23.000000
25%    25.500000
50%    28.000000
75%    29.000000
max    30.000000

In [16]:
#read a csv file from folder. create a .csv file first.

# making data frame from csv file


file = pd.read_csv('liva.csv')

In [17]:
file

   Unnamed: 0  train no  speed    city
0           0      1234    431    bbsr
1           1      5678    122   delhi
2           2      8612     51  kokata
3           3      7832     67    kota

In [18]:
# to access any column

file['speed']

0    431
1    122
2     51
3     67
Name: speed, dtype: int64

In [19]:
# access any index of any column

file['speed'][0]

431

In [20]:
# if we want to change value of any entry

file['speed'][0]=431

<ipython-input-20-fba45e8aab6d>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  file['speed'][0]=431

In [21]:
# value is changed and displayed here. but in csv file its not changed unless you write it
file

   Unnamed: 0  train no  speed    city
0           0      1234    431    bbsr
1           1      5678    122   delhi
2           2      8612     51  kokata
3           3      7832     67    kota

In [22]:
#value updated in csv file

file.to_csv('liva.csv')

In [23]:
#change the indexing

file.index = ['1st','2nd','3rd','4th']

In [24]:
file

     Unnamed: 0  train no  speed    city
1st           0      1234    431    bbsr
2nd           1      5678    122   delhi
3rd           2      8612     51  kokata
4th           3      7832     67    kota

In [25]:
# retrieving row by loc method. you have to choose one coloumn

file = pd.read_csv("liva.csv", index_col ="city")

file.loc['kota']

Unnamed: 0         3
Unnamed: 0.1       3
train no        7832
speed             67
Name: kota, dtype: int64

In [26]:
#pandas have 2 types of data structure- series and dataframe

series1 = pd.Series(np.random.rand(5))        #creates a random 1-D series from 0 to 4

In [27]:
series1

0    0.331588
1    0.334805
2    0.912564
3    0.165953
4    0.520177
dtype: float64

In [28]:
type(series1)

pandas.core.series.Series

In [29]:
newdf = pd.DataFrame(np.random.rand(5,4))    #df is a 2D-data structurenew

In [30]:
newdf

          0         1         2         3
0  0.861911  0.144588  0.059183  0.621741
1  0.177847  0.857582  0.662017  0.823708
2  0.723811  0.218875  0.437295  0.531746
3  0.616815  0.714849  0.646767  0.502017
4  0.776420  0.494614  0.837961  0.498507

In [31]:
type(newdf)

pandas.core.frame.DataFrame

In [32]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
dtype: object

In [33]:
newdf.index

RangeIndex(start=0, stop=5, step=1)

In [34]:
newdf.columns

RangeIndex(start=0, stop=4, step=1)

In [35]:
#convert df to numpy array
newdf.to_numpy()

array([[0.86191071, 0.1445885 , 0.0591825 , 0.62174115],
       [0.17784691, 0.85758187, 0.66201665, 0.82370816],
       [0.7238113 , 0.2188752 , 0.43729486, 0.53174576],
       [0.61681522, 0.71484942, 0.64676674, 0.5020166 ],
       [0.77642031, 0.49461443, 0.83796107, 0.49850737]])

In [36]:
#Transpose of df
newdf.T

          0         1         2         3         4
0  0.861911  0.177847  0.723811  0.616815  0.776420
1  0.144588  0.857582  0.218875  0.714849  0.494614
2  0.059183  0.662017  0.437295  0.646767  0.837961
3  0.621741  0.823708  0.531746  0.502017  0.498507

In [37]:
#sorting index, by default ascending= True. axis=0 is for rows. ascending false means reverse order

newdf.sort_index(axis=0, ascending=False)

          0         1         2         3
4  0.776420  0.494614  0.837961  0.498507
3  0.616815  0.714849  0.646767  0.502017
2  0.723811  0.218875  0.437295  0.531746
1  0.177847  0.857582  0.662017  0.823708
0  0.861911  0.144588  0.059183  0.621741

In [38]:
#axis=1 is for columns
newdf.sort_index(axis=1, ascending=False)

          3         2         1         0
0  0.621741  0.059183  0.144588  0.861911
1  0.823708  0.662017  0.857582  0.177847
2  0.531746  0.437295  0.218875  0.723811
3  0.502017  0.646767  0.714849  0.616815
4  0.498507  0.837961  0.494614  0.776420

In [39]:
type(newdf[0])  #gives you 0th column and its dtype is series

pandas.core.series.Series

In [40]:
#df.loc[]-Access a group of rows and columns by label(s) or a boolean array.

newdf.loc[0,0] = 0.111      # value changed at 0th row and 0th col

In [41]:
newdf

          0         1         2         3
0  0.111000  0.144588  0.059183  0.621741
1  0.177847  0.857582  0.662017  0.823708
2  0.723811  0.218875  0.437295  0.531746
3  0.616815  0.714849  0.646767  0.502017
4  0.776420  0.494614  0.837961  0.498507

In [126]:
#can change col names

newdf.columns = list('abcd')

In [127]:
newdf

          a         b         c         d
1  0.111000  0.144588  0.059183  0.621741
2  0.177847  0.857582  0.662017  0.823708
3  0.723811  0.218875  0.437295  0.531746
4  0.616815  0.714849  0.646767  0.502017
5  0.776420  0.494614  0.837961  0.498507

In [128]:
newdf.index = list('01234')

In [129]:
newdf

          a         b         c         d
0  0.111000  0.144588  0.059183  0.621741
1  0.177847  0.857582  0.662017  0.823708
2  0.723811  0.218875  0.437295  0.531746
3  0.616815  0.714849  0.646767  0.502017
4  0.776420  0.494614  0.837961  0.498507

In [130]:
newdf.loc[0,0] = 0.111   # if we do this, it adds an extra row,col to df

In [131]:
newdf

          a         b         c         d      0
0  0.111000  0.144588  0.059183  0.621741    NaN
1  0.177847  0.857582  0.662017  0.823708    NaN
2  0.723811  0.218875  0.437295  0.531746    NaN
3  0.616815  0.714849  0.646767  0.502017    NaN
4  0.776420  0.494614  0.837961  0.498507    NaN
0       NaN       NaN       NaN       NaN  0.111

In [132]:
# drop extra added col, axis=1 means col

newdf=newdf.drop(0,axis=1) # here the original newdf changes as we assigned to it, otherwise it wont change

In [133]:
#drop extra added row 

newdf=newdf.drop(0,axis=0)

In [134]:
newdf

          a         b         c         d
0  0.111000  0.144588  0.059183  0.621741
1  0.177847  0.857582  0.662017  0.823708
2  0.723811  0.218875  0.437295  0.531746
3  0.616815  0.714849  0.646767  0.502017
4  0.776420  0.494614  0.837961  0.498507

In [115]:
newdf

          a         b         c         d
1  0.111000  0.144588  0.059183  0.621741
2  0.177847  0.857582  0.662017  0.823708
3  0.723811  0.218875  0.437295  0.531746
4  0.616815  0.714849  0.646767  0.502017
5  0.776420  0.494614  0.837961  0.498507

In [136]:
newdf.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [138]:
newdf.index

Index(['0', '1', '2', '3', '4'], dtype='object')

In [139]:
newdf = pd.DataFrame(np.random.rand(5,4))

In [144]:
newdf

          0         1         2         3
0  0.094329  0.064195  0.546456  0.623532
1  0.343928  0.032827  0.077712  0.639930
2  0.634026  0.616416  0.753750  0.876266
3  0.739828  0.498701  0.595477  0.418553
4  0.662437  0.530257  0.605713  0.117345

In [147]:
#access row,col values
#df.loc[]-Access a group of rows and columns by label(s) or a boolean array.

newdf.loc[[1,2],[2,3]]

          2         3
1  0.077712  0.639930
2  0.753750  0.876266

In [149]:
# to access all rows

newdf.loc[:,[2,3]]

          2         3
0  0.546456  0.623532
1  0.077712  0.639930
2  0.753750  0.876266
3  0.595477  0.418553
4  0.605713  0.117345

In [151]:
# to access all cols

newdf.loc[[1,2],:]

          0         1         2         3
1  0.343928  0.032827  0.077712  0.639930
2  0.634026  0.616416  0.753750  0.876266

In [154]:
newdf

          0         1         2         3
0  0.094329  0.064195  0.546456  0.623532
1  0.343928  0.032827  0.077712  0.639930
2  0.634026  0.616416  0.753750  0.876266
3  0.739828  0.498701  0.595477  0.418553
4  0.662437  0.530257  0.605713  0.117345

In [155]:
newdf.columns = list('abcd')

In [156]:
newdf

          a         b         c         d
0  0.094329  0.064195  0.546456  0.623532
1  0.343928  0.032827  0.077712  0.639930
2  0.634026  0.616416  0.753750  0.876266
3  0.739828  0.498701  0.595477  0.418553
4  0.662437  0.530257  0.605713  0.117345

In [158]:
#complex queries

newdf.loc[newdf['a']<0.5] # returns values of col 'a' < 0.5, so row 0 and 1 returned

          a         b         c         d
0  0.094329  0.064195  0.546456  0.623532
1  0.343928  0.032827  0.077712  0.639930

In [160]:
newdf.loc[(newdf['a']<0.5) & (newdf['c']>0.5)]

          a         b         c         d
0  0.094329  0.064195  0.546456  0.623532

In [161]:
newdf.head(2)

          a         b         c         d
0  0.094329  0.064195  0.546456  0.623532
1  0.343928  0.032827  0.077712  0.639930

In [163]:
# access value of 0th row and 3rd col, starts from 0,1,2,3 = a,b,c,d

#df.iloc[]- Purely integer-location based indexing for selection by position.

newdf.iloc[0,3]

0.6235320731323201

In [165]:
# rows 1,2 and col= 2,3
newdf.iloc[[1,2],[2,3]]

          c         d
1  0.077712  0.639930
2  0.753750  0.876266

In [168]:
newdf.drop(['c'],axis=1)      # this is only a copy of newdf as we havent assigned it to newdf

# newdf.drop(['c'],axis=1, inplace=True) #this will change in original newdf

#newdf = newdf.drop(['c'],axis=1) # this will change the original newdf

          a         b         d
0  0.094329  0.064195  0.623532
1  0.343928  0.032827  0.639930
2  0.634026  0.616416  0.876266
3  0.739828  0.498701  0.418553
4  0.662437  0.530257  0.117345

In [169]:
newdf           #original newdf not changed

          a         b         c         d
0  0.094329  0.064195  0.546456  0.623532
1  0.343928  0.032827  0.077712  0.639930
2  0.634026  0.616416  0.753750  0.876266
3  0.739828  0.498701  0.595477  0.418553
4  0.662437  0.530257  0.605713  0.117345

In [170]:
newdf.drop([2],axis=0)  # drops 2nd index

          a         b         c         d
0  0.094329  0.064195  0.546456  0.623532
1  0.343928  0.032827  0.077712  0.639930
3  0.739828  0.498701  0.595477  0.418553
4  0.662437  0.530257  0.605713  0.117345

In [172]:
# newdf.reset_index() # resets index from 0 to 4, but adds an extra index col.
    
newdf.reset_index(drop=True)  # DROPS THE EXTRA INDEX COL.

          a         b         c         d
0  0.094329  0.064195  0.546456  0.623532
1  0.343928  0.032827  0.077712  0.639930
2  0.634026  0.616416  0.753750  0.876266
3  0.739828  0.498701  0.595477  0.418553
4  0.662437  0.530257  0.605713  0.117345

In [173]:
newdf['b'].isnull()   #isnull()- returns True where the value is null in col b

0    False
1    False
2    False
3    False
4    False
Name: b, dtype: bool

In [182]:
# newdf['c'] = None        # sets all values in col 'c' to None

newdf.loc[:, 'c'] = None # always do like this if you want to change in original df.

In [183]:
newdf

          a         b     c         d
0  0.094329  0.064195  None  0.623532
1  0.343928  0.032827  None  0.639930
2  0.634026  0.616416  None  0.876266
3  0.739828  0.498701  None  0.418553
4  0.662437  0.530257  None  0.117345

In [184]:
newdf['c'].isnull()

0    True
1    True
2    True
3    True
4    True
Name: c, dtype: bool

In [188]:
newdf.loc[:,'c']= 34

In [189]:
newdf

           a          b   c          d
0   0.094329   0.064195  34   0.623532
1   0.343928   0.032827  34   0.639930
2   0.634026   0.616416  34   0.876266
3   0.739828   0.498701  34   0.418553
4   0.662437   0.530257  34   0.117345
c  34.000000  34.000000  34  34.000000

In [190]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [191]:
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [192]:
#Remove missing values.
df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [194]:
# Determine if row or column is removed from DataFrame, when we have at least one NA or all NA.

df.dropna(how='all')

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [196]:
df.shape

(3, 3)

In [198]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 200.0+ bytes

In [199]:
df['name'].value_counts()

Alfred      1
Batman      1
Catwoman    1
Name: name, dtype: int64

In [201]:
# returns True where value is NOT NULL
df.notnull()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False

In [206]:
#CREATE df having only integers. 3 rows, 2 cols

df1 = pd.DataFrame(np.random.randint(0,10,size=(3, 2)))

In [207]:
df1

   0  1
0  1  8
1  4  1
2  6  2

In [209]:
df1.describe()

              0         1
count  3.000000  3.000000
mean   3.666667  3.666667
std    2.516611  3.785939
min    1.000000  1.000000
25%    2.500000  1.500000
50%    4.000000  2.000000
75%    5.000000  5.000000
max    6.000000  8.000000

In [213]:
df1.mean()

0    3.666667
1    3.666667
dtype: float64

In [215]:
#Compute pairwise correlation of columns, excluding NA/null values
df1.corr()

          0         1
0  1.000000 -0.857146
1 -0.857146  1.000000

In [223]:
#Return cumulative maximum over a DataFrame or Series axis.
df1.max(axis=1)

0    8
1    4
2    6
dtype: int32

In [224]:
df1.max(axis=0)

0    6
1    8
dtype: int32

In [222]:
#Count non-NA cells for each column or row.
df1.count()

0    2
1    2
2    2
dtype: int64

In [221]:
df1.min()

0    1
1    1
dtype: int32

In [225]:
df1.median()

0    4.0
1    2.0
dtype: float64

In [226]:
df1.std()

0    2.516611
1    3.785939
dtype: float64